@jpenalver10 Thanks for raising this issue.

I am unable to reproduce your error with the configuration you provided:

```hcl
locals {
  tags = {}
}

resource "aws_apigatewayv2_api" "fx_notification" {
  name                         = "fx-notification-working-copy"
  protocol_type                = "WEBSOCKET"
  route_selection_expression   = "$request.body.message"
  description                  = "FX notification working copy - WEBSOCKET"
  api_key_selection_expression = "$context.authorizer.usageIdentifierKey"
}

resource "aws_apigatewayv2_route" "ConnectRoute" {
  api_id    = aws_apigatewayv2_api.fx_notification.id
  route_key = "$connect"
}

resource "aws_apigatewayv2_deployment" "deployment" {
  api_id = aws_apigatewayv2_api.fx_notification.id

  depends_on = [
    aws_apigatewayv2_route.ConnectRoute,
    //aws_apigatewayv2_route.DisconnectRoute
  ]
}

resource "aws_apigatewayv2_stage" "Stage" {
  api_id        = aws_apigatewayv2_api.fx_notification.id
  name          = "test001" // var.stage_name
  description   = "Deployed in ${timestamp()}"
  deployment_id = aws_apigatewayv2_deployment.deployment.id

  default_route_settings {
    data_trace_enabled       = true
    detailed_metrics_enabled = true
    logging_level            = "INFO"
    throttling_burst_limit   = 0
    throttling_rate_limit    = 0
  }
}

###########
# default route
###########
resource "aws_apigatewayv2_integration" "DefaultIntegrat" {
  api_id           = aws_apigatewayv2_api.fx_notification.id
  integration_type = "MOCK"
  description      = "Default Integration"
}

resource "aws_apigatewayv2_route" "DefaultRoute" {
  api_id         = aws_apigatewayv2_api.fx_notification.id
  route_key      = "$default"
  operation_name = "DefaultRoute"
  target         = "integrations/${aws_apigatewayv2_integration.DefaultIntegrat.id}"
}

#---------------------------------------------------------
# API usage plan - no quota - no throttling
resource "aws_api_gateway_usage_plan" "agup_notifications" {
  name        = "fx-notification-working-copy-usage-plan-ENV"
  description = "notification API usage plan"

  api_stages {
    api_id = aws_apigatewayv2_api.fx_notification.id
    stage  = aws_apigatewayv2_stage.Stage.name
  }
  tags = merge(map("Name", "agup_notifications"), local.tags)
}

#---------------------------------------------------------
# API key
resource "aws_api_gateway_api_key" "api_key_fx" {
  name  = "fx-notification-working-copy-fx-ENV"
  tags  = merge(map("Name", "api_key_fx"), local.tags)
  value = "1234567890abcdef1234567890abcdef" //var.fx-notification-working-copyApiKey
}

resource "aws_api_gateway_usage_plan_key" "usage_plan_key_notification" {
  key_id        = aws_api_gateway_api_key.api_key_fx.id
  key_type      = "API_KEY"
  usage_plan_id = aws_api_gateway_usage_plan.agup_notifications.id
}
```

```console
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_api_key.api_key_fx will be created
  + resource "aws_api_gateway_api_key" "api_key_fx" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "fx-notification-working-copy-fx-ENV"
      + tags              = {
          + "Name" = "api_key_fx"
        }
      + value             = (sensitive value)
    }

  # aws_api_gateway_usage_plan.agup_notifications will be created
  + resource "aws_api_gateway_usage_plan" "agup_notifications" {
      + arn         = (known after apply)
      + description = "notification API usage plan"
      + id          = (known after apply)
      + name        = "fx-notification-working-copy-usage-plan-ENV"
      + tags        = {
          + "Name" = "agup_notifications"
        }

      + api_stages {
          + api_id = (known after apply)
          + stage  = "test001"
        }
    }

  # aws_api_gateway_usage_plan_key.usage_plan_key_notification will be created
  + resource "aws_api_gateway_usage_plan_key" "usage_plan_key_notification" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # aws_apigatewayv2_api.fx_notification will be created
  + resource "aws_apigatewayv2_api" "fx_notification" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$context.authorizer.usageIdentifierKey"
      + arn                          = (known after apply)
      + description                  = "FX notification working copy - WEBSOCKET"
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "fx-notification-working-copy"
      + protocol_type                = "WEBSOCKET"
      + route_selection_expression   = "$request.body.message"
    }

  # aws_apigatewayv2_deployment.deployment will be created
  + resource "aws_apigatewayv2_deployment" "deployment" {
      + api_id        = (known after apply)
      + auto_deployed = (known after apply)
      + id            = (known after apply)
    }

  # aws_apigatewayv2_integration.DefaultIntegrat will be created
  + resource "aws_apigatewayv2_integration" "DefaultIntegrat" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Default Integration"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "MOCK"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.ConnectRoute will be created
  + resource "aws_apigatewayv2_route" "ConnectRoute" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$connect"
    }

  # aws_apigatewayv2_route.DefaultRoute will be created
  + resource "aws_apigatewayv2_route" "DefaultRoute" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + operation_name     = "DefaultRoute"
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.Stage will be created
  + resource "aws_apigatewayv2_stage" "Stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = false
      + deployment_id = (known after apply)
      + description   = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "test001"

      + default_route_settings {
          + data_trace_enabled       = true
          + detailed_metrics_enabled = true
          + logging_level            = "INFO"
          + throttling_burst_limit   = 0
          + throttling_rate_limit    = 0
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_apigatewayv2_api.fx_notification: Creating...
aws_api_gateway_api_key.api_key_fx: Creating...
aws_api_gateway_api_key.api_key_fx: Creation complete after 1s [id=x5k3eopvub]
aws_apigatewayv2_api.fx_notification: Creation complete after 1s [id=cn6vwni6mf]
aws_apigatewayv2_route.ConnectRoute: Creating...
aws_apigatewayv2_integration.DefaultIntegrat: Creating...
aws_apigatewayv2_route.ConnectRoute: Creation complete after 1s [id=wvu4iv0]
aws_apigatewayv2_deployment.deployment: Creating...
aws_apigatewayv2_integration.DefaultIntegrat: Creation complete after 1s [id=eg95sc9]
aws_apigatewayv2_route.DefaultRoute: Creating...
aws_apigatewayv2_route.DefaultRoute: Creation complete after 1s [id=h1nxjtg]
aws_apigatewayv2_deployment.deployment: Creation complete after 2s [id=biunot]
aws_apigatewayv2_stage.Stage: Creating...
aws_apigatewayv2_stage.Stage: Creation complete after 2s [id=test001]
aws_api_gateway_usage_plan.agup_notifications: Creating...
aws_api_gateway_usage_plan.agup_notifications: Creation complete after 1s [id=e74sz0]
aws_api_gateway_usage_plan_key.usage_plan_key_notification: Creating...
aws_api_gateway_usage_plan_key.usage_plan_key_notification: Creation complete after 1s [id=x5k3eopvub]

Apply complete! Resources: 9 added, 0 changed, 0 destroyed.
```

I can only force the error by creating a second `aws_api_gateway_api_key` resource with the same value:

```hcl
#---------------------------------------------------------
# Second API key
resource "aws_api_gateway_api_key" "api_key_fx_2" {
  name  = "fx-notification-working-copy-fx-ENV-2"
  tags  = merge(map("Name", "api_key_fx"), local.tags)
  value = "1234567890abcdef1234567890abcdef"
}
```

```console
$ terraform apply
aws_api_gateway_api_key.api_key_fx: Refreshing state... [id=x5k3eopvub]
aws_apigatewayv2_api.fx_notification: Refreshing state... [id=cn6vwni6mf]
aws_apigatewayv2_route.ConnectRoute: Refreshing state... [id=wvu4iv0]
aws_apigatewayv2_integration.DefaultIntegrat: Refreshing state... [id=eg95sc9]
aws_apigatewayv2_route.DefaultRoute: Refreshing state... [id=h1nxjtg]
aws_apigatewayv2_deployment.deployment: Refreshing state... [id=biunot]
aws_apigatewayv2_stage.Stage: Refreshing state... [id=test001]
aws_api_gateway_usage_plan.agup_notifications: Refreshing state... [id=e74sz0]
aws_api_gateway_usage_plan_key.usage_plan_key_notification: Refreshing state... [id=x5k3eopvub]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_api_key.api_key_fx_2 will be created
  + resource "aws_api_gateway_api_key" "api_key_fx_2" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "fx-notification-working-copy-fx-ENV-2"
      + tags              = {
          + "Name" = "api_key_fx"
        }
      + value             = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_api_gateway_api_key.api_key_fx_2: Creating...

Error: Error creating API Gateway API Key: ConflictException: API Key already exists
```